#liu et al

nc: 6
depth_multiple: 0.33
width_multiple: 0.25

backbone:
  # [from, repeats, module, args]
  # Early layers: Standard convolutions (low-level features don't benefit from DCN)
  - [-1, 1, Conv, [64, 3, 2]]            # 0-P1/2 - Edge detection (Krizhevsky et al. 2012)
  - [-1, 1, Conv, [128, 3, 2]]           # 1-P2/4 - Texture patterns
  - [-1, 3, C2f, [128, True]]            # 2 - Standard: features too simple for DCN (Zhu et al. 2019)

  # Middle layers: DCN v2 for adaptive geometric modeling
  - [-1, 1, Conv, [256, 3, 2]]           # 3-P3/8 - Transition to semantic features
  - [-1, 6, DeformC2f, [256, True]]      # 4 - DCN v2! Handles small-medium objects (Zhu et al. 2019, Sec. 4.2)
  - [-1, 1, Conv, [512, 3, 2]]           # 5-P4/16 - Transition
  - [-1, 6, DeformC2f, [512, True]]      # 6 - DCN v2! Critical layer for deformation (Zhu et al. 2019, Table 1)

  # Deep layers: Standard convolutions (large receptive field sufficient)
  - [-1, 1, Conv, [1024, 3, 2]]          # 7-P5/32 - High-level semantics
  - [-1, 3, C2f, [1024, True]]           # 8 - Standard: 256×256 RF, DCN not needed
  - [-1, 1, SPPF, [1024, 5]]             # 9 - Spatial pyramid pooling (He et al. 2015)

head:
  - [-1, 1, Conv, [512, 1, 1]]           # 8
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 9  -> P4/16
  - [[-1, 5], 1, Concat, [1]]            # 10 (P5 up + P4)

  - [-1, 2, DeformC2f, [512, 3]]         # 11  P4/16
  - [-1, 1, Conv, [256, 1, 1]]           # 12
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 13  -> P3/8

  - [[-1, 3], 1, Concat, [1]]            # 14 (P4 up + P3)
  - [-1, 2, C2f, [256, 3]]               # 15  P3/8
  - [-1, 1, Conv, [128, 1, 1]]           # 16
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 17  -> P2/4
  - [[-1, 1], 1, Concat, [1]]            # 18 (P3 up + P2)
  - [-1, 2, C2f, [128, 3]]               # 19  P2/4

  - [[15, 11, 8], 1, Detect, [nc]]       # 20 (P3, P4, P5)